---
kind: other
id: Properties.T:Autodesk.Revit.DB.NumericRevisionSettings
source: html/d265041b-5366-5d6d-4e6f-161d3a040632.htm
---
# NumericRevisionSettings Properties

Specifies whether the .NET object represents a valid Revit entity.